#Задача 3
#Задана поизвольная строка. Необходимо разбить ее на две части . Задачу решить с помощью срезов.
#Пример:
#str = "Hello world!"
#Ответ: Первая часть "Hello" Вторая часть "world!"

msg = "Hello world!"
print(msg[:5])
print(msg[6:12])