#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

# Почему кода я пишу вот так: у меня не вывоводит в консоли результат?
# a = int(input())
# b = int(input())
# А если вот так пишу, то выводит?
a = 2
b = 3

# сумма
print(a + b)
# разность
print(a - b)
# частное
print(a / b)
# целочисленное деление
print(a // b)
# деление с остатком
print(a % b)
# возведение в сепень
print(a ** 3)
print(b ** 2)
