#todo: Определить в коде  переменные:

#1. Целочисленного типа
x = 2
print(x)
#2. Вещественного типа
t = "19,5"
print(t)
#3. Логического типа
a = True
print(type(a))
b = False
print(type(b))
#4. Строкового типа
m = "15,5"
print(type(t))
#5. Пустого типа
a = None
print(type(a))
a = None
if a == None:
    print("a - None.")
else:
    print("a = не None.")
#Вывести все их типы.


